/*
SQLyog Ultimate v12.08 (64 bit)
MySQL - 5.6.24 : Database - db_myblog
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`db_myblog` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `db_myblog`;

/*Table structure for table `t_blog` */

DROP TABLE IF EXISTS `t_blog`;

CREATE TABLE `t_blog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(200) DEFAULT NULL,
  `summary` text,
  `content` text,
  `releaseDate` datetime DEFAULT NULL,
  `click` int(11) DEFAULT NULL,
  `blogTypeId` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8;

/*Data for the table `t_blog` */

insert  into `t_blog`(`id`,`title`,`summary`,`content`,`releaseDate`,`click`,`blogTypeId`) values (50,'短路与&&和逻辑与&、短路或||和逻辑或|的区别','1.短路&amp;&amp;和逻辑&amp;\n\n相同点：\n\n有假则为假，全真则为真（有假必假，全真为真）\n\n区别：\n\n逻辑与&amp;的判断方式是：从左到右依次判断，直到结尾（逻辑全程运算）\n\n短路与&amp;&amp;的判断方式是：从左到右依次判断，直到出现false为止将不再判断，直接得到结果为false（短路遇false就停）\n\n示例：\n\n逻辑与&amp;\n\n\n\n短路与&amp;&amp;\n\n\n\n2.短路||和逻辑|\n\n共同点：\n\n有真则为真，全假则为假（有真必真，全假为假）\n\n区别：\n\n逻辑或|的判断方式是：从左到右依次判断，直到结尾\n\n短路或||的判断方式是：从左到右依次判断，直到出现true为止将不再判断，直接得到结果为true（短路遇true就停止）\n\n示例：\n\n逻辑或|\n\n\n\n短路或||\n\n\n\nPS.\n\n开发的时候用短路与&amp;&amp;和短路或||，可以减少程序运行时间\n','<h3>1.短路&amp;&amp;和逻辑&amp;</h3>\r\n\r\n<p><span style=\"font-size:14px\">相同点：</span></p>\r\n\r\n<p><span style=\"font-size:14px\">有假则为假，全真则为真（有假必假，全真为真）</span></p>\r\n\r\n<p><span style=\"font-size:14px\">区别：</span></p>\r\n\r\n<p><span style=\"font-size:14px\">逻辑与&amp;的判断方式是：从左到右依次判断，直到结尾（逻辑全程运算）</span></p>\r\n\r\n<p><span style=\"font-size:14px\">短路与&amp;&amp;的判断方式是：从左到右依次判断，直到出现false为止将不再判断，直接得到结果为false（短路遇false就停）</span></p>\r\n\r\n<p><span style=\"font-size:14px\">示例：</span></p>\r\n\r\n<p><span style=\"font-size:14px\">逻辑与&amp;</span></p>\r\n\r\n<p><span style=\"font-size:14px\"><img alt=\"\" src=\"/static/images/blogImage/20201020162940.jpg\" style=\"height:446px; width:800px\" /></span></p>\r\n\r\n<p><span style=\"font-size:14px\">短路与&amp;&amp;</span></p>\r\n\r\n<p><span style=\"font-size:14px\"><img alt=\"\" src=\"/static/images/blogImage/20201020163050.jpg\" style=\"height:389px; width:800px\" /></span></p>\r\n\r\n<p><span style=\"font-size:14px\">2.短路||和逻辑|</span></p>\r\n\r\n<p><span style=\"font-size:14px\">共同点：</span></p>\r\n\r\n<p><span style=\"font-size:14px\">有真则为真，全假则为假（有真必真，全假为假）</span></p>\r\n\r\n<p><span style=\"font-size:14px\">区别：</span></p>\r\n\r\n<p><span style=\"font-size:14px\">逻辑或|的判断方式是：从左到右依次判断，直到结尾</span></p>\r\n\r\n<p><span style=\"font-size:14px\">短路或||的判断方式是：从左到右依次判断，直到出现true为止将不再判断，直接得到结果为true（短路遇true就停止）</span></p>\r\n\r\n<p><span style=\"font-size:14px\">示例：</span></p>\r\n\r\n<p><span style=\"font-size:14px\">逻辑或|</span></p>\r\n\r\n<p><span style=\"font-size:14px\"><img alt=\"\" src=\"/static/images/blogImage/20201020165415.jpg\" style=\"height:440px; width:800px\" /></span></p>\r\n\r\n<p><span style=\"font-size:14px\">短路或||</span></p>\r\n\r\n<p><img alt=\"\" src=\"/static/images/blogImage/20201020165551.jpg\" style=\"height:379px; width:800px\" /></p>\r\n\r\n<h3>PS.</h3>\r\n\r\n<p><span style=\"font-size:14px\">开发的时候用短路与&amp;&amp;和短路或||，可以减少程序运行时间</span></p>\r\n','2020-10-20 16:31:37',15,1);

/*Table structure for table `t_blogtype` */

DROP TABLE IF EXISTS `t_blogtype`;

CREATE TABLE `t_blogtype` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) DEFAULT NULL,
  `sortNum` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

/*Data for the table `t_blogtype` */

insert  into `t_blogtype`(`id`,`name`,`sortNum`) values (1,'Java基础',2),(5,'idea使用',4),(6,'个人项目',1),(7,'其它',6),(8,'Tomcat',5),(11,'MySQL',3);

/*Table structure for table `t_interview_record` */

DROP TABLE IF EXISTS `t_interview_record`;

CREATE TABLE `t_interview_record` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `interviewerIp` varchar(100) DEFAULT NULL,
  `interviewContent` varchar(100) DEFAULT NULL,
  `interviewDate` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=338 DEFAULT CHARSET=utf8;

/*Data for the table `t_interview_record` */

insert  into `t_interview_record`(`id`,`interviewerIp`,`interviewContent`,`interviewDate`) values (17,'111.202.101.106','访问博客首页','2020-10-18 05:36:37'),(18,'47.101.193.191','访问博客首页','2020-10-18 05:40:09'),(19,'213.81.178.115','访问博客首页','2020-10-18 05:44:53'),(20,'2.57.122.193','访问博客首页','2020-10-18 07:26:13'),(21,'59.173.196.111','访问博客首页','2020-10-18 08:41:04'),(22,'59.173.196.45','访问博客首页','2020-10-18 08:54:56'),(23,'101.251.242.238','访问博客首页','2020-10-18 09:11:13'),(24,'116.179.32.155','访问博客首页','2020-10-18 09:20:29'),(25,'116.179.32.215','查看博客：idea将spring boot项目打包成war包','2020-10-18 09:20:29'),(26,'114.35.109.138','访问博客首页','2020-10-18 09:20:33'),(27,'116.179.32.73','查看博客：idea中git远程版本回退','2020-10-18 09:29:12'),(28,'116.179.32.89','查看博客：idea连接MySQL数据库','2020-10-18 09:29:12'),(29,'47.101.195.248','访问博客首页','2020-10-18 09:38:04'),(30,'220.181.108.173','查看博客：idea彻底删除一个项目','2020-10-18 09:47:12'),(33,'116.179.32.167','查看博客：第一个Java程序:HelloWorld','2020-10-18 11:29:45'),(34,'42.236.10.75','访问博客首页','2020-10-18 11:38:46'),(35,'42.236.10.75','访问博客首页','2020-10-18 11:38:47'),(36,'180.163.220.68','查看博客：个人博客系统','2020-10-18 11:45:10'),(37,'36.110.199.8','查看博客：个人博客系统','2020-10-18 11:57:33'),(38,'116.179.32.76','查看博客：标识符','2020-10-18 12:05:45'),(39,'47.103.71.140','访问博客首页','2020-10-18 12:33:03'),(40,'103.45.117.242','访问博客首页','2020-10-18 12:48:57'),(41,'116.179.32.132','访问博客首页','2020-10-18 12:59:45'),(42,'116.179.32.20','访问博客首页','2020-10-18 13:01:30'),(43,'116.179.32.66','访问博客首页','2020-10-18 13:01:31'),(44,'69.176.25.210','访问博客首页','2020-10-18 13:05:20'),(48,'88.198.41.133','访问博客首页','2020-10-18 13:20:26'),(50,'116.179.32.223','查看博客：windows10系统定时关机cmd命令','2020-10-18 16:05:30'),(51,'1.244.33.66','访问博客首页','2020-10-18 16:16:52'),(52,'49.7.21.84','访问博客首页','2020-10-18 16:17:47'),(53,'111.202.101.114','访问博客首页','2020-10-18 16:34:43'),(54,'116.179.32.48','访问博客首页','2020-10-18 17:05:30'),(56,'106.38.241.163','查看博客：MySQL单表查询','2020-10-18 17:35:09'),(59,'116.179.32.76','访问博客首页','2020-10-18 17:48:11'),(60,'220.134.47.21','访问博客首页','2020-10-18 17:53:41'),(61,'220.134.210.96','访问博客首页','2020-10-18 17:54:01'),(62,'111.202.101.108','查看博客：idea maven工具栏按钮的作用','2020-10-18 18:37:07'),(64,'156.96.128.142','访问博客首页','2020-10-18 18:59:00'),(65,'123.183.224.98','访问博客首页','2020-10-18 18:59:40'),(66,'113.175.62.156','访问博客首页','2020-10-18 20:00:39'),(67,'116.179.32.76','访问博客首页','2020-10-18 20:20:12'),(68,'106.38.241.147','查看博客：宠物医院管理系统','2020-10-18 20:46:38'),(69,'114.34.254.234','访问博客首页','2020-10-18 20:48:38'),(72,'122.117.100.227','访问博客首页','2020-10-18 21:37:57'),(73,'212.15.11.218','访问博客首页','2020-10-18 21:40:54'),(74,'123.183.224.98','查看博客：idea将spring boot项目打包成war包','2020-10-18 21:42:18'),(75,'106.38.241.147','查看博客：MySQL对表数据进行增删改','2020-10-18 21:48:46'),(76,'106.38.241.163','查看博客：MySQL创建表语句','2020-10-18 22:47:49'),(77,'220.181.108.100','访问博客首页','2020-10-18 22:52:11'),(82,'190.94.144.230','访问博客首页','2020-10-19 00:54:00'),(86,'119.23.174.205','访问博客首页','2020-10-19 01:12:36'),(87,'111.202.101.104','访问博客首页','2020-10-19 01:43:11'),(99,'220.133.251.8','访问博客首页','2020-10-19 02:57:51'),(108,'111.206.36.11','访问博客首页','2020-10-19 03:43:50'),(109,'47.101.150.223','访问博客首页','2020-10-19 03:52:41'),(110,'51.15.149.118','访问博客首页','2020-10-19 04:42:22'),(111,'74.120.14.36','访问博客首页','2020-10-19 06:01:33'),(112,'74.120.14.36','访问博客首页','2020-10-19 06:01:33'),(113,'171.105.248.148','查看博客：个人博客系统','2020-10-19 07:35:19'),(114,'171.105.248.148','查看博客：IntelliJ IDEA 连接数据库报错及解决！','2020-10-19 07:36:56'),(115,'180.163.220.66','查看博客：IntelliJ IDEA 连接数据库报错及解决！','2020-10-19 07:39:03'),(116,'109.111.144.39','访问博客首页','2020-10-19 08:45:17'),(117,'213.202.223.223','访问博客首页','2020-10-19 08:52:30'),(118,'27.68.20.149','访问博客首页','2020-10-19 09:11:12'),(119,'128.14.134.134','访问博客首页','2020-10-19 09:16:58'),(120,'101.132.169.73','访问博客首页','2020-10-19 09:41:36'),(121,'123.183.224.98','访问博客首页','2020-10-19 09:48:37'),(122,'177.11.136.75','访问博客首页','2020-10-19 10:10:51'),(123,'112.27.29.190','访问博客首页','2020-10-19 11:06:41'),(124,'13.52.79.128','访问博客首页','2020-10-19 11:06:54'),(125,'87.244.44.222','访问博客首页','2020-10-19 11:29:06'),(126,'113.238.26.196','访问博客首页','2020-10-19 11:29:25'),(127,'218.59.175.57','访问博客首页','2020-10-19 12:06:50'),(128,'47.94.39.226','访问博客首页','2020-10-19 12:28:00'),(129,'94.228.196.247','访问博客首页','2020-10-19 13:17:44'),(132,'220.181.108.178','查看博客：Java环境配置','2020-10-19 13:22:10'),(133,'220.181.108.160','访问博客首页','2020-10-19 13:22:11'),(134,'116.179.32.155','访问博客首页','2020-10-19 13:22:12'),(135,'87.18.234.247','访问博客首页','2020-10-19 13:26:02'),(136,'120.55.13.109','访问博客首页','2020-10-19 13:26:26'),(138,'171.105.248.148','查看博客：进制','2020-10-19 13:42:56'),(139,'171.105.248.148','查看博客：MySQL单表查询','2020-10-19 13:47:42'),(140,'116.179.32.133','查看博客：EasyUI标签页右键单击事件添加','2020-10-19 13:51:40'),(141,'164.68.112.178','访问博客首页','2020-10-19 13:51:45'),(142,'218.85.135.250','访问博客首页','2020-10-19 14:12:00'),(143,'47.102.157.25','访问博客首页','2020-10-19 14:47:52'),(144,'49.7.21.120','访问博客首页','2020-10-19 14:54:10'),(145,'195.32.127.47','访问博客首页','2020-10-19 15:04:28'),(146,'185.39.11.105','访问博客首页','2020-10-19 15:13:47'),(147,'183.136.225.46','访问博客首页','2020-10-19 15:26:30'),(148,'116.179.32.83','访问博客首页','2020-10-19 15:28:20'),(149,'94.111.23.79','访问博客首页','2020-10-19 15:41:42'),(150,'116.179.32.93','查看博客：进制','2020-10-19 16:18:20'),(151,'123.183.224.22','访问博客首页','2020-10-19 16:24:17'),(152,'198.20.103.242','访问博客首页','2020-10-19 16:28:39'),(153,'187.93.134.176','访问博客首页','2020-10-19 17:28:29'),(154,'220.181.108.187','查看博客：阿里云设置二级域名','2020-10-19 17:34:53'),(155,'123.183.224.98','访问博客首页','2020-10-19 17:35:38'),(156,'106.38.241.147','查看博客：quartz定时任务cron表达式','2020-10-19 17:41:44'),(157,'220.181.108.180','访问博客首页','2020-10-19 17:55:39'),(158,'116.179.32.73','查看博客：进销存系统','2020-10-19 18:01:59'),(159,'156.96.128.142','访问博客首页','2020-10-19 18:05:15'),(160,'60.191.125.35','访问博客首页','2020-10-19 18:15:54'),(161,'123.183.224.98','查看博客：第一个Java程序:HelloWorld','2020-10-19 18:37:34'),(162,'111.202.101.104','查看博客：IntelliJ IDEA 连接数据库报错及解决！','2020-10-19 18:40:39'),(163,'106.38.241.147','查看博客：idea彻底删除一个项目','2020-10-19 18:46:52'),(164,'49.7.21.120','查看博客：idea连接MySQL数据库','2020-10-19 19:02:56'),(165,'116.179.32.17','查看博客：MySQL单表查询','2020-10-19 19:14:58'),(166,'42.83.147.202','访问博客首页','2020-10-19 19:33:01'),(167,'42.83.147.202','访问博客首页','2020-10-19 19:33:22'),(168,'42.83.147.202','访问博客首页','2020-10-19 19:33:42'),(169,'116.179.32.211','查看博客：Github私有仓库改为公开','2020-10-19 19:48:12'),(170,'116.179.32.201','访问博客首页','2020-10-19 20:42:40'),(171,'59.126.224.65','访问博客首页','2020-10-19 20:50:25'),(172,'116.179.32.243','查看博客：Tomcat多域名配置','2020-10-19 21:32:05'),(173,'111.202.101.104','查看博客：用Tomcat运行web项目','2020-10-19 21:40:40'),(174,'185.140.56.1','访问博客首页','2020-10-19 21:48:56'),(175,'106.38.241.147','查看博客：HTML特殊字符编码对照表','2020-10-19 21:54:20'),(183,'106.38.241.147','查看博客：idea中git远程版本回退','2020-10-19 22:49:24'),(184,'111.202.101.104','查看博客：Tomcat运行web项目不带项目名字','2020-10-19 23:07:35'),(185,'116.179.32.96','访问博客首页','2020-10-19 23:28:44'),(186,'156.96.128.142','访问博客首页','2020-10-20 00:03:57'),(187,'143.202.191.234','访问博客首页','2020-10-20 00:24:28'),(188,'59.127.98.178','访问博客首页','2020-10-20 01:21:46'),(189,'101.132.44.71','访问博客首页','2020-10-20 01:35:33'),(190,'115.79.27.70','访问博客首页','2020-10-20 01:36:15'),(191,'47.97.21.76','访问博客首页','2020-10-20 01:51:28'),(192,'14.184.14.37','访问博客首页','2020-10-20 02:06:10'),(193,'92.10.114.62','访问博客首页','2020-10-20 02:11:59'),(194,'83.97.20.29','访问博客首页','2020-10-20 04:16:15'),(195,'111.202.101.104','访问博客首页','2020-10-20 04:47:59'),(196,'182.218.152.87','访问博客首页','2020-10-20 06:02:32'),(197,'47.101.201.45','访问博客首页','2020-10-20 06:23:12'),(198,'47.101.192.162','访问博客首页','2020-10-20 06:30:15'),(199,'118.222.208.33','访问博客首页','2020-10-20 06:33:20'),(200,'101.132.156.172','访问博客首页','2020-10-20 06:43:07'),(201,'111.206.36.18','访问博客首页','2020-10-20 09:15:36'),(202,'116.179.32.50','查看博客：SpringBoot2.0实现自定义404页面渲染','2020-10-20 09:40:19'),(203,'49.7.21.120','访问博客首页','2020-10-20 09:43:12'),(204,'14.169.120.85','访问博客首页','2020-10-20 09:49:29'),(207,'213.202.223.223','访问博客首页','2020-10-20 10:22:59'),(208,'162.142.125.35','访问博客首页','2020-10-20 10:26:17'),(209,'162.142.125.35','访问博客首页','2020-10-20 10:26:18'),(210,'220.181.108.94','访问博客首页','2020-10-20 11:10:19'),(211,'220.181.108.163','访问博客首页','2020-10-20 11:13:03'),(212,'220.181.108.160','查看博客：宠物医院管理系统','2020-10-20 11:22:03'),(213,'180.163.220.4','访问博客首页','2020-10-20 11:34:00'),(214,'180.163.220.4','访问博客首页','2020-10-20 11:34:04'),(216,'128.201.163.136','访问博客首页','2020-10-20 12:04:21'),(217,'93.171.5.141','访问博客首页','2020-10-20 13:24:50'),(218,'180.76.170.52','访问博客首页','2020-10-20 13:34:25'),(221,'116.179.32.101','访问博客首页','2020-10-20 14:08:39'),(225,'120.78.231.236','访问博客首页','2020-10-20 14:44:21'),(227,'123.183.224.98','访问博客首页','2020-10-20 14:59:24'),(228,'183.136.225.56','访问博客首页','2020-10-20 15:30:41'),(229,'139.162.106.181','访问博客首页','2020-10-20 15:35:16'),(235,'49.7.20.124','访问博客首页','2020-10-20 16:37:09'),(236,'167.248.133.36','访问博客首页','2020-10-20 16:53:30'),(237,'167.248.133.36','访问博客首页','2020-10-20 16:53:30'),(241,'49.7.21.120','查看博客：进销存系统','2020-10-20 17:54:28'),(242,'123.183.224.98','查看博客：windows10系统定时关机cmd命令','2020-10-20 17:54:43'),(243,'106.38.241.147','查看博客：Github私有仓库改为公开','2020-10-20 18:01:29'),(245,'171.105.248.148','查看博客：基本数据类型之间的转换（显式转换和隐式转换）','2020-10-20 18:30:23'),(246,'171.105.248.148','查看博客：短路与&&和逻辑与&、短路或||和逻辑或|的区别','2020-10-20 18:30:27'),(247,'97.85.231.151','访问博客首页','2020-10-20 18:41:47'),(248,'106.38.241.147','查看博客：Java中的关键字','2020-10-20 18:46:11'),(249,'47.94.52.159','访问博客首页','2020-10-20 19:34:20'),(250,'220.133.6.18','访问博客首页','2020-10-20 19:41:45'),(251,'111.202.101.104','查看博客：标识符','2020-10-20 19:44:13'),(252,'123.183.224.98','访问博客首页','2020-10-20 20:36:59'),(253,'111.202.101.104','查看博客：SpringBoot2.0实现自定义404页面渲染','2020-10-20 20:41:47'),(254,'128.14.133.58','访问博客首页','2020-10-20 20:49:27'),(255,'192.241.237.93','访问博客首页','2020-10-20 21:28:07'),(256,'123.183.224.98','查看博客：EasyUI标签页右键单击事件添加','2020-10-20 21:38:36'),(257,'171.105.248.148','查看博客：EasyUI标签页右键单击事件添加','2020-10-20 21:43:14'),(258,'171.105.248.148','查看博客：idea中git远程版本回退','2020-10-20 21:44:17'),(259,'49.7.21.120','查看博客：idea快捷键大全','2020-10-20 22:04:59'),(260,'186.211.3.39','访问博客首页','2020-10-20 22:10:18'),(261,'186.211.3.39','访问博客首页','2020-10-20 22:10:18'),(262,'47.100.64.9','访问博客首页','2020-10-20 22:13:54'),(263,'111.202.101.104','查看博客：Java环境配置','2020-10-20 22:51:38'),(264,'171.105.248.148','查看博客：idea快捷键大全','2020-10-20 23:00:45'),(265,'116.179.32.220','访问博客首页','2020-10-20 23:23:39'),(266,'115.236.62.43','访问博客首页','2020-10-20 23:48:26'),(267,'115.236.62.43','访问博客首页','2020-10-20 23:48:26'),(268,'116.179.32.211','查看博客：MySQL创建表语句','2020-10-21 00:08:39'),(269,'220.181.108.174','查看博客：基本数据类型','2020-10-21 00:12:53'),(277,'116.179.32.33','查看博客：短路与&&和逻辑与&、短路或||和逻辑或|的区别','2020-10-21 00:17:23'),(278,'116.179.32.211','查看博客：基本数据类型之间的转换（显式转换和隐式转换）','2020-10-21 00:17:23');

/*Table structure for table `t_user` */

DROP TABLE IF EXISTS `t_user`;

CREATE TABLE `t_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userName` varchar(100) DEFAULT NULL,
  `password` varchar(100) DEFAULT NULL,
  `nickName` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `t_user` */

insert  into `t_user`(`id`,`userName`,`password`,`nickName`) values (1,'admin','123456','乐道');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
